import { Head, Html, Main, NextScript } from "next/document";

export default function Document() {
  return (
    <Html lang="en">
      <Head>
        <meta
          name="description"
          content="STF Energo: Надійні Силові Трансформатори та Енергетичне Обладнання
Компанія СТФ Енерго спеціалізується на виробництві, ревізії та ремонті енергетичного обладнання, зокрема силових трансформаторів. Ми пропонуємо широкий асортимент продукції, включаючи трансформатори типів ТМ, ТМГ, ТМЗ, ТМН, а також комплексні трансформаторні підстанції (КТП). Наші масляні трансформатори забезпечують стабільне та ефективне енергопостачання для промислових та комерційних об'єктів.

Наші послуги включають:

Професійна ревізія трансформаторів
Капітальний ремонт силових трансформаторів
Монтаж і технічне обслуговування КТП
Компанія STF Energo гарантує високу якість обладнання та сервісу, що відповідає сучасним вимогам енергетичної галузі."
        />
      </Head>
      <body>
        <Main />
        <NextScript />
      </body>
    </Html>
  );
}
